In [16]:
import numpy as np
import pandas as pd

In [17]:
# Pandas series - simple one dimentional array
s1 = pd.Series(['antonio', 'joana', 'carlos'])
s1

0    antonio
1      joana
2     carlos
dtype: object

In [18]:
s2 = pd.Series({1: 'one', 2: 'two', 3: 'three'})
s2

1      one
2      two
3    three
dtype: object

In [19]:
# Pandas DataFrames - like an SQL table or Excel sheet
df = pd.DataFrame({"one": [1, 2, 3, 4], "two": [5, 6, 7, 8]})

In [20]:
df

   one  two
0    1    5
1    2    6
2    3    7
3    4    8

In [31]:
df = pd.read_csv('PD06-09/gym2_q1.csv', sep=';', parse_dates=['date'])

In [32]:
df.head(3)

,id,name,date,height,weight,age,hours,status,children,sex,class,city,years,rank
0,1373913,Marisa Martins,05/02/2013,155,48,45,3,married,2,F,cycle,Porto,9,good
1,1109818,Rita Fonseca,28/08/2018,166,54,45,3,married,3,F,hydrogymnastics,Matosinhos,3,fair
2,1158813,Joana Freitas,21/10/2013,150,42,52,3,widow,1,F,zumba,Porto,8,good

In [33]:
df.loc[(df['age'] > 55) & (df['sex'] == 'F') & (df['status'].isin(['married', 'divorced'])), ['name', 'weight']]

                 name  weight
3     Joana Goncalves      49
7           Rita Cruz      52
15     Susana Madeira      49
32      Joana Marinho      51
43  Catarina Carvalho      45

In [34]:
df.iloc[:, 2].head(3)

0    05/02/2013
1    28/08/2018
2    21/10/2013
Name: date, dtype: object

In [35]:
df.sort_values('children', ascending=False).head(5)

,id,name,date,height,weight,age,hours,status,children,sex,class,city,years,rank
12,1170413,Susana Goncalves,03/07/2013,157,65,40,2,married,5,F,hydrogymnastics,Porto,8,good
33,1610119,Pedro Madeira,19/05/2019,163,53,28,5,married,4,M,pilates,Gaia,2,fair
43,1058304,Catarina Carvalho,25/09/2004,150,45,59,2,married,4,F,swimming,Gondomar,17,excellent
1,1109818,Rita Fonseca,28/08/2018,166,54,45,3,married,3,F,hydrogymnastics,Matosinhos,3,fair
25,1867513,Antonio Fonseca,06/07/2013,164,53,41,3,married,3,M,zumba,Valongo,8,good

In [36]:
# Statistical functions
print('Mean height:', round(df['height'].mean(), 2), '\nMax age:', df['age'].max())

Mean height: 163.53
Max age: 59

In [44]:
df.groupby('sex')['status'].value_counts()

sex  status
F    married     20
     single       7
     widow        2
     divorced     1
M    married     16
     single      12
     divorced     1
     widow        1
Name: count, dtype: int64

In [42]:
df.pivot_table(index='city', columns='status', values='age', aggfunc='mean', margins=True).round(2)

status      divorced  married  single  widow    All
city
Gaia             NaN    36.75   36.17    NaN  36.40
Gondomar         NaN    41.67   29.25    NaN  34.57
Maia            56.0    38.67   30.00   57.0  39.88
Matosinhos       NaN    43.56   35.00    NaN  42.70
Porto           40.0    43.46   31.20   52.0  40.65
Valongo          NaN    45.25     NaN   59.0  48.00
All             48.0    42.39   32.37   56.0  40.08